DileepMys/HERO_RAA_2.0V/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v12.0
processor: MIMXRT1172xxxxx
package_id: MIMXRT1172AVM8A
mcu_data: ksdk2_0
processor_version: 12.0.1
pin_labels:
- {pin_num: H1, pin_signal: GPIO_EMC_B1_37, label: 'SEMC_D15/U13[53]', identifier: SEMC_D15;DI_HANDLEBAR_SW_DOWN_MCU_IN}
- {pin_num: U2, pin_signal: GPIO_EMC_B2_19, label: ENET_RGMII_MDC, identifier: ENET_RGMII_MDC;DO_BATT_MON_EN}
- {pin_num: P3, pin_signal: DCDC_PSWITCH, label: MCU_DCDC_IN/VDD_3V3, identifier: DCDC_PSWITCH}
- {pin_num: R3, pin_signal: GPIO_EMC_B2_20, label: ENET_RGMII_MDIO, identifier: ENET_RGMII_MDIO;FUEL_SBATT_CTRL_MCUOUT}
- {pin_num: N12, pin_signal: GPIO_AD_00, label: 'SIM1_TRXD/J44[C7]/J57[9]/CTP_INT/J48[29]/J25[15]/J9[14]', identifier: SIM1_TRXD;illum;Illum_PWM}
- {pin_num: B15, pin_signal: GPIO_SD_B1_04, label: 'SD1_D2/J15[1]/WIFI_SDIO_D2/J54[17]', identifier: SD1_D2;DI_HANDLEBAR_SW_RETURN_MCU_IN}
- {pin_num: C15, pin_signal: GPIO_SD_B1_02, label: LOW_OIL, identifier: SD1_D0;DI_LOW_OIL_PRESSURE_MCU_IN}
- {pin_num: D15, pin_signal: GPIO_SD_B1_01, label: 'SD1_CLK/J15[5]/WIFI_SDIO_CLK/J54[9]', identifier: SD1_CLK;DI_HANDLEBAR_SW_DOWN_MCU_IN}
- {pin_num: A16, pin_signal: GPIO_SD_B1_05, label: 'SD1_D3/J15[2]/WIFI_SDIO_D3/J54[19]', identifier: SD1_D3;DI_HANDLEBAR_SW_UP_MCU_IN}
- {pin_num: B17, pin_signal: GPIO_SD_B1_03, label: 'SD1_D1/J15[8]/WIFI_SDIO_D1/J54[15]', identifier: SET_BUTTON_IN;DI_HANDLEBAR_SW_SET_MCU_IN}
- {pin_num: N7, pin_signal: GPIO_LPSR_04, label: 'I2C5_SDA/J48[26]/U32[18]/U34[6]/J10[18]', identifier: I2C5_SDA;EEPROM_I2C_SDA}
- {pin_num: N8, pin_signal: GPIO_LPSR_05, label: 'I2C5_SCL/J48[27]/U32[17]/U34[4]/J10[20]', identifier: I2C5_SCL;EEPROM_I2C_SCL}
- {pin_num: U8, pin_signal: GPIO_LPSR_08, label: 'DMIC_CLK/U41[1]/U44[1]/J50[18]', identifier: DOUT_BTLE_PS_RST}
- {pin_num: D13, pin_signal: GPIO_DISP_B1_01, label: 'ENET_RGMII_RXC/U10[27]', identifier: ENET_RGMII_RXC;tft_csb}
- {pin_num: R13, pin_signal: GPIO_AD_02, label: 'SIM1_RST/J57[5]/J44[C2]/LCD_RST_B/J48[21]/J25[11]/J10[6]', identifier: SIM1_RST;tft_xres}
- {pin_num: P15, pin_signal: GPIO_AD_03, label: 'SIM1_SVEN/J57[2]/Flash_RST/U21[B2]/J25[9]/J10[8]', identifier: SIM1_SVEN;FOG_LAMP}
- {pin_num: M13, pin_signal: GPIO_AD_04, label: 'SIM1_PD/J44[C8]/USER_LED_CTL1/J9[8]/J25[7]', identifier: SIM1_PD;batt_sw}
- {pin_num: R16, pin_signal: GPIO_AD_09, label: 'USB_OTG1_ID/U28[3]/U26[A1]/J26[10]/J20[4]', identifier: FEUL_IN;AI_FUEL_MCU_IN}
- {pin_num: R17, pin_signal: GPIO_AD_10, label: 'USB_OTG1_PWR/J26[2]/U26[A1]', identifier: SBAT}
- {pin_num: P16, pin_signal: GPIO_AD_11, label: 'USB_OTG1_OC/U26[A2]/J26[4]', identifier: AI_SBATTFUEL_MON_MCU_IN}
- {pin_num: L12, pin_signal: GPIO_AD_13, label: 'SPDIF_SR_CLK/ANATOP_32K_OUT/J26[8]', identifier: TT_SS_DIG_MCU_OUT}
- {pin_num: N14, pin_signal: GPIO_AD_14, label: 'SPDIF_EXT_CLK/CAN_STBY/J9[16]', identifier: CAN_STB}
- {pin_num: M14, pin_signal: GPIO_AD_15, label: 'SPDIF_IN/U43[4]/BT_RST#/U16[14]/J54[54]', identifier: SPDIF_IN;tft_3v3}
- {pin_num: N17, pin_signal: GPIO_AD_16, label: 'SPDIF_OUT/WIFI_RST_B/U354[3]', identifier: SPDIF_OUT;bllt;bklt}
- {pin_num: N15, pin_signal: GPIO_AD_17, label: 'SAI1_MCLK/U32[11]/J9[15]', identifier: BLE_3P3V_EN}
- {pin_num: M16, pin_signal: GPIO_AD_18, label: 'SAI1_RX_SYNC/J9[5]/J50[19]/U32[13]', identifier: AI_SSTT_FDBK_DIAG}
- {pin_num: L16, pin_signal: GPIO_AD_19, label: 'SAI1_RX_BCLK/J9[1]/J50[18]/U32[12]', identifier: ABS}
- {pin_num: K13, pin_signal: GPIO_AD_20, label: 'SAI1_RXD[0]/J9[7]/J50[20]/J61[1]/BT_PCM_RXD/U16[10]/U355[18]', identifier: en_5v}
- {pin_num: L17, pin_signal: GPIO_AD_28, label: 'LPSPI1_SCK/U27[6]/BT_DEV_WAKE/U354[9]/U16[39]/J10[12]', identifier: LPSPI1_SCK;batt_en}
- {pin_num: K16, pin_signal: GPIO_AD_32, label: 'ENET_MDC/U7[12]/SD1_CD_B/J15[9]', identifier: ENET_MDC;BTLE_UART_TX}
- {pin_num: H17, pin_signal: GPIO_AD_33, label: 'ENET_MDIO/U7[11]', identifier: BTLE_UART_RX}
- {pin_num: T8, pin_signal: WAKEUP, label: DI_IGN_MCU_IN, identifier: DI_IGN_MCU_IN}
- {pin_num: M17, pin_signal: GPIO_AD_29, label: LPSP1_PCS0, identifier: LPSP1_PCS0;LPSPI1_PCS0}
- {pin_num: P8, pin_signal: GPIO_LPSR_06, label: I2C6_SDA, identifier: I2C6_SDA}
- {pin_num: R8, pin_signal: GPIO_LPSR_07, label: I2C6_SCL, identifier: I2C6_SCL}
- {pin_num: B1, pin_signal: GPIO_EMC_B1_14, label: SEMC_A5, identifier: SEMC_A5}
- {pin_num: C1, pin_signal: GPIO_EMC_B1_15, label: SEMC_A6, identifier: SEMC_A6}
- {pin_num: D1, pin_signal: GPIO_EMC_B1_32, label: SEMC_D10, identifier: SEMC_D10}
- {pin_num: E1, pin_signal: GPIO_EMC_B1_34, label: SEMC_D12, identifier: SEMC_D12}
- {pin_num: F1, pin_signal: GPIO_EMC_B1_35, label: SEMC_D13, identifier: SEMC_D13}
- {pin_num: G1, pin_signal: GPIO_EMC_B1_36, label: SEMC_D14, identifier: SEMC_D14}
- {pin_num: J1, pin_signal: GPIO_EMC_B1_38, label: SEMC_DM1, identifier: SEMC_DM1}
- {pin_num: K1, pin_signal: GPIO_EMC_B1_40, label: SEMC_RDY, identifier: SEMC_RDY}
- {pin_num: L1, pin_signal: GPIO_EMC_B1_41, label: SEMC_CSX0, identifier: SEMC_CSX0}
- {pin_num: M1, pin_signal: GPIO_EMC_B2_04, label: SEMC_D20, identifier: SEMC_D20}
- {pin_num: N1, pin_signal: GPIO_EMC_B2_05, label: SEMC_D21, identifier: SEMC_D21}
- {pin_num: P1, pin_signal: GPIO_EMC_B2_08, label: SEMC_DM2, identifier: SEMC_DM2}
- {pin_num: R1, pin_signal: GPIO_EMC_B2_03, label: SEMC_D19, identifier: SEMC_D19}
- {pin_num: T1, pin_signal: GPIO_EMC_B2_06, label: SEMC_D22, identifier: SEMC_D22}
- {pin_num: A2, pin_signal: GPIO_EMC_B1_10, label: SEMC_A1, identifier: SEMC_A1}
- {pin_num: B2, pin_signal: GPIO_EMC_B1_23, label: SEMC_A10, identifier: SEMC_A10}
- {pin_num: C2, pin_signal: GPIO_EMC_B1_11, label: SEMC_A2, identifier: SEMC_A2}
- {pin_num: D2, pin_signal: GPIO_EMC_B1_31, label: SEMC_D9, identifier: SEMC_D9}
- {pin_num: E2, pin_signal: GPIO_EMC_B1_33, label: SEMC_D11, identifier: SEMC_D11}
- {pin_num: F2, pin_signal: GPIO_EMC_B1_01, label: SEMC_D1, identifier: SEMC_D1}
- {pin_num: G2, pin_signal: GPIO_EMC_B1_21, label: SEMC_BA0, identifier: SEMC_BA0}
- {pin_num: H2, pin_signal: GPIO_EMC_B1_22, label: SEMC_BA1, identifier: SEMC_BA1}
- {pin_num: J2, pin_signal: GPIO_EMC_B1_39, label: SEMC_DQS, identifier: SEMC_DQS}
- {pin_num: K2, pin_signal: GPIO_EMC_B2_00, label: SEMC_D16, identifier: SEMC_D16}
- {pin_num: L2, pin_signal: GPIO_EMC_B2_15, label: SEMC_D30, identifier: SEMC_D30}
- {pin_num: M2, pin_signal: GPIO_EMC_B2_12, label: SEMC_D27, identifier: SEMC_D27}
- {pin_num: N2, pin_signal: GPIO_EMC_B2_09, label: SEMC_D24, identifier: SEMC_D24}
- {pin_num: P2, pin_signal: GPIO_EMC_B2_16, label: SEMC_D21, identifier: SEMC_D31}
- {pin_num: R2, pin_signal: GPIO_EMC_B2_10, label: SEMC_D25, identifier: SEMC_D25}
- {pin_num: T2, pin_signal: GPIO_EMC_B2_17, label: SEMC_DM3, identifier: SEMC_DM3}
- {pin_num: A3, pin_signal: GPIO_EMC_B1_09, label: SEMC_A0, identifier: SEMC_A0}
- {pin_num: B3, pin_signal: GPIO_EMC_B1_17, label: SEMC_A8, identifier: SEMC_A8}
- {pin_num: C3, pin_signal: GPIO_EMC_B1_20, label: SEMC_A12, identifier: SEMC_A12}
- {pin_num: D3, pin_signal: GPIO_EMC_B1_16, label: SEMC_A7, identifier: SEMC_A7}
- {pin_num: E3, pin_signal: GPIO_EMC_B1_30, label: SEMC_D8, identifier: SEMC_D8}
- {pin_num: F3, pin_signal: GPIO_EMC_B1_00, label: SEMC_D0, identifier: SEMC_D0}
- {pin_num: H3, pin_signal: GPIO_EMC_B1_07, label: SEMC_D7, identifier: SEMC_D7}
- {pin_num: J3, pin_signal: GPIO_EMC_B1_26, label: SEMC_CLK, identifier: SEMC_CLK}
- {pin_num: K3, pin_signal: GPIO_EMC_B2_02, label: SEMC_D18, identifier: SEMC_D18}
- {pin_num: G3, pin_signal: VSS2, label: GND}
- {pin_num: L3, pin_signal: VSS3, label: GND}
- {pin_num: M3, pin_signal: GPIO_EMC_B2_07, label: SEMC_D23, identifier: SEMC_D23}
- {pin_num: N3, pin_signal: GPIO_EMC_B2_18, label: SEMC_DQS4, identifier: SEMC_DQS4}
- {pin_num: T3, pin_signal: DCDC_LP0, label: DCDC_LP_1}
- {pin_num: U3, pin_signal: DCDC_LP1, label: DCDC_LP_2}
- {pin_num: B4, pin_signal: GPIO_EMC_B1_18, label: SEMC_A9, identifier: SEMC_A9}
- {pin_num: C4, pin_signal: GPIO_EMC_B1_19, label: SEMC_A11, identifier: SEMC_A11}
- {pin_num: D4, pin_signal: VSS4, label: GND}
- {pin_num: E4, pin_signal: GPIO_EMC_B1_03, label: SEMC_D3, identifier: SEMC_D3}
- {pin_num: F4, pin_signal: GPIO_EMC_B1_05, label: SEMC_D5, identifier: SEMC_D5}
- {pin_num: G4, pin_signal: GPIO_EMC_B1_02, label: SEMC_D2, identifier: SEMC_D2}
- {pin_num: H4, pin_signal: GPIO_EMC_B1_06, label: SEMC_D6, identifier: SEMC_D6}
- {pin_num: J4, pin_signal: GPIO_EMC_B1_25, label: SEMC_RAS, identifier: SEMC_RAS}
- {pin_num: K4, pin_signal: GPIO_EMC_B2_01, label: SEMC_D17, identifier: SEMC_D17}
- {pin_num: L4, pin_signal: GPIO_EMC_B2_11, label: SEMC_D26, identifier: SEMC_D26}
- {pin_num: M4, pin_signal: GPIO_EMC_B2_14, label: SEMC_D29, identifier: SEMC_D29}
- {pin_num: N4, pin_signal: DCDC_MODE, label: MCU_DCDC_IN}
- {pin_num: P4, pin_signal: VSS5, label: GND}
- {pin_num: R4, pin_signal: VSS6, label: GND}
- {pin_num: T4, pin_signal: DCDC_LN0, label: DCDC_LN_1}
- {pin_num: U4, pin_signal: DCDC_LN1, label: DCDC_LN_2}
- {pin_num: A5, pin_signal: GPIO_DISP_B2_13, label: BT_UART_RTS, identifier: BT_UART_RTS}
- {pin_num: B5, pin_signal: GPIO_DISP_B2_08, label: ENET_CRS_DV, identifier: ENET_CRS_DV}
- {pin_num: C5, pin_signal: GPIO_EMC_B1_12, label: SEMC_A3, identifier: SEMC_A3}
- {pin_num: D5, pin_signal: GPIO_EMC_B1_13, label: SEMC_A4, identifier: SEMC_A4}
- {pin_num: E5, pin_signal: GPIO_EMC_B1_28, label: SEMC_WE, identifier: SEMC_WE}
- {pin_num: F5, pin_signal: GPIO_EMC_B1_08, label: SEMC_DM0, identifier: SEMC_DM0}
- {pin_num: G5, pin_signal: GPIO_EMC_B1_27, label: SEMC_CKE, identifier: SEMC_CKE}
- {pin_num: H5, pin_signal: GPIO_EMC_B1_04, label: SEMC_D4, identifier: SEMC_D4}
- {pin_num: J5, pin_signal: GPIO_EMC_B1_24, label: SEMC_CAS, identifier: SEMC_CAS}
- {pin_num: K5, pin_signal: GPIO_EMC_B2_13, label: SEMC_D28, identifier: SEMC_D28}
- {pin_num: A6, pin_signal: GPIO_DISP_B2_11, label: BT_UART_RXD, identifier: BT_UART_RXD}
- {pin_num: B6, pin_signal: GPIO_DISP_B2_12, label: GPIO_DISP_B2_12, identifier: GPIO_DISP_B2_12}
- {pin_num: C6, pin_signal: GPIO_DISP_B2_06, label: ENET_RXD0, identifier: ENET_RXD0}
- {pin_num: D6, pin_signal: GPIO_DISP_B2_07, label: ENET_RXD1, identifier: ENET_RXD1}
- {pin_num: E6, pin_signal: GPIO_EMC_B1_29, label: SEMC_CS0, identifier: SEMC_CS0}
- {pin_num: N6, pin_signal: GPIO_LPSR_00, label: CAN3_TX, identifier: CAN3_TX}
- {pin_num: R6, pin_signal: GPIO_LPSR_01, label: CAN3_RX, identifier: CAN3_RX}
- {pin_num: B7, pin_signal: VSS7, label: GND}
- {pin_num: C7, pin_signal: GPIO_DISP_B2_04, label: ENET_TXEN, identifier: ENET_TXEN}
- {pin_num: D7, pin_signal: GPIO_DISP_B2_03, label: ENET_TXD1, identifier: ENET_TXD1}
- {pin_num: A8, pin_signal: MIPI_DSI_DN0, label: MIPI_DSI_DN0, identifier: MIPI_DSI_DN0}
- {pin_num: B8, pin_signal: MIPI_DSI_DP0, label: MIPI_DSI_DPO, identifier: MIPI_DSI_DPO}
- {pin_num: C8, pin_signal: VSS12, label: GND}
- {pin_num: D8, pin_signal: GPIO_DISP_B2_09, label: ENET_RXER, identifier: ENET_RXER}
- {pin_num: G8, pin_signal: VSS13, label: GND}
- {pin_num: H8, pin_signal: VDD_SOC_IN0, label: VDD_SDC_IN}
- {pin_num: J8, pin_signal: VDD_SOC_IN1, label: VDD_SDC_IN}
- {pin_num: K8, pin_signal: DCDC_DIG0, label: VDD_SDC_IN}
- {pin_num: L8, pin_signal: DCDC_DIG1, label: VDD_SDC_IN}
- {pin_num: M8, pin_signal: DCDC_ANA1, label: DCDC_1V8_OUT}
- {pin_num: A9, pin_signal: MIPI_DSI_CKN, label: MIPI_DSI_CLKN, identifier: MIPI_DSI_CLKN}
- {pin_num: B9, pin_signal: MIPI_DSI_CKP, label: MIPI_DSI_CLKP, identifier: MIPI_DSI_CLKP}
- {pin_num: C9, pin_signal: GPIO_DISP_B2_05, label: ENET_TX_REF_CLK, identifier: ENET_TX_REF_CLK}
- {pin_num: D9, pin_signal: GPIO_DISP_B2_10, label: BT_UART_TXD, identifier: BT_UART_TXD}
- {pin_num: E9, pin_signal: GPIO_DISP_B2_02, label: ENET_TXD0, identifier: ENET_TXD0}
- {pin_num: F9, pin_signal: VDD_MIPI_1P8, label: VDD_1V8}
- {pin_num: G9, pin_signal: VSS14, label: GND}
- {pin_num: H9, pin_signal: VDD_SOC_IN2, label: VDD_SDC_IN}
- {pin_num: J9, pin_signal: VDD_SOC_IN3, label: VDD_SDC_IN}
- {pin_num: U9, pin_signal: PMIC_ON_REQ, label: PMIC_ON_REQ, identifier: PMIC_ON_REQ}
- {pin_num: A10, pin_signal: MIPI_DSI_DN1, label: MIPI_DSI_DN1, identifier: MIPI_DSI_DN1}
- {pin_num: B10, pin_signal: MIPI_DSI_DP1, label: MIPI_DSI_DP1, identifier: MIPI_DSI_DP1}
- {pin_num: C10, pin_signal: VSS15, label: GND}
- {pin_num: D10, pin_signal: GPIO_DISP_B1_06, label: ENET_RGMII_TXD3, identifier: ENET_RGMII_TXD3}
- {pin_num: E10, pin_signal: GPIO_DISP_B1_04, label: ENET_RGMII_RXD2, identifier: ENET_RGMII_RXD2}
- {pin_num: F10, pin_signal: VDD_MIPI_1P0, label: VDDA_1P0}
- {pin_num: G10, pin_signal: VSS16, label: GND}
- {pin_num: H10, pin_signal: VDD_SOC_IN4, label: VDD_SDC_IN}
- {pin_num: K10, pin_signal: VDD_SOC_IN6, label: VDD_SDC_IN}
- {pin_num: J10, pin_signal: VDD_SOC_IN5, label: VDD_SDC_IN}
- {pin_num: L10, pin_signal: VSS17, label: GND}
- {pin_num: T10, pin_signal: POR_B, label: RST_TGTMCU_B;POR_B, identifier: RST_TGTMCU_B;POR_B}
- {pin_num: U10, pin_signal: ONOFF, label: ONOFF, identifier: ONOFF}
- {pin_num: A11, pin_signal: MIPI_CSI_DN0, label: MIPI_CSI_DN0, identifier: MIPI_CSI_DN0}
- {pin_num: B11, pin_signal: MIPI_CSI_DP0, label: MIPI_CSI_DP0, identifier: MIPI_CSI_DP0}
- {pin_num: C11, pin_signal: GPIO_DISP_B1_05, label: ENET_RGMII_RXD3, identifier: ENET_RGMII_RXD3}
- {pin_num: D11, pin_signal: GPIO_DISP_B1_02, label: ENET_RGMII_RXD0, identifier: ENET_RGMII_RXD0}
- {pin_num: E11, pin_signal: GPIO_DISP_B1_03, label: ENET_RGMII_RXD1, identifier: ENET_RGMII_RXD1}
- {pin_num: F11, pin_signal: VSS18, label: GND}
- {pin_num: G11, pin_signal: VSS19, label: GND}
- {pin_num: H11, pin_signal: VSS20, label: GND}
- {pin_num: J11, pin_signal: VSS21, label: GND}
- {pin_num: K11, pin_signal: VSS22, label: GND}
- {pin_num: L11, pin_signal: VSS23, label: GND}
- {pin_num: M11, pin_signal: VDDA_1P8_IN, label: ADC_1V8_IN}
- {pin_num: N11, pin_signal: VDDA_1P0, label: VDDA_1P0}
- {pin_num: P11, pin_signal: VDD_LPSR_DIG, label: VDD_LPSR_DIG}
- {pin_num: T11, pin_signal: TEST_MODE, label: GND}
- {pin_num: U11, pin_signal: NVCC_SNVS, label: VDD_SNVS_ANA}
- {pin_num: A12, pin_signal: MIPI_CSI_CKN, label: MIPI_CSI_CLKN, identifier: MIPI_CSI_CLKN}
- {pin_num: B12, pin_signal: MIPI_CSI_CKP, label: MIPI_CSI_CLKP, identifier: MIPI_CSI_CLKP}
- {pin_num: C12, pin_signal: VSS24, label: GND}
- {pin_num: D12, pin_signal: NVCC_DISP1, label: VDD_1V8}
- {pin_num: E12, pin_signal: GPIO_DISP_B1_07, label: ENET_RGMII_TXD2, identifier: ENET_RGMII_TXD2}
- {pin_num: F12, pin_signal: VSS25, label: GND}
- {pin_num: G12, pin_signal: VDD_USB_3P3, label: VDD_3V3}
- {pin_num: H12, pin_signal: VDD_USB_1P8, label: VDD_1V8}
- {pin_num: J12, pin_signal: GPIO_AD_23, label: BT_PCM_SYNC, identifier: BT_PCM_SYNC}
- {pin_num: K12, pin_signal: GPIO_AD_22, label: BT_PCM_BCLK, identifier: BT_PCM_BCLK}
- {pin_num: M12, pin_signal: NVCC_GPIO, label: VDD_3V3}
- {pin_num: P12, pin_signal: VDD_LPSR_ANA, label: VDD_LPSR_ANA}
- {pin_num: R12, pin_signal: VDD_LPSR_IN, label: VDD_LPSR_3V3}
- {pin_num: T12, pin_signal: VSS26, label: GND}
- {pin_num: U12, pin_signal: VDD_SNVS_IN, label: VDD_SNVS_IN}
- {pin_num: A13, pin_signal: MIPI_CSI_DN1, label: MIPI_CSI_DN1, identifier: MIPI_CSI_DN1}
- {pin_num: B13, pin_signal: MIPI_CSI_DP1, label: MIPI_CSI_DP1, identifier: MIPI_CSI_DP1}
- {pin_num: C13, pin_signal: GPIO_DISP_B1_09, label: ENET_RGMII_TXD0, identifier: ENET_RGMII_TXD0}
- {pin_num: E13, pin_signal: GPIO_DISP_B1_00, label: ENET_RGMII_RX_EN, identifier: ENET_RGMII_RX_EN}
- {pin_num: F13, pin_signal: VSS27, label: GND}
- {pin_num: G13, pin_signal: NVCC_SD2, label: FLASH_VCC}
- {pin_num: J13, pin_signal: VDDA_ADC_3P3, label: VDD_3V3}
- {pin_num: T13, pin_signal: RTC_XTALI, label: RTC_XTALI, identifier: RTC_XTALI}
- {pin_num: U13, pin_signal: RTC_XTALO, label: RTC_XTALO, identifier: RTC_XTALO}
- {pin_num: A14, pin_signal: GPIO_DISP_B1_11, label: ENET_RGMII_TXC, identifier: ENET_RGMII_TXC}
- {pin_num: B14, pin_signal: GPIO_DISP_B1_10, label: ENET_RGMII_TX_EN, identifier: ENET_RGMII_TX_EN}
- {pin_num: C14, pin_signal: VSS28, label: GND}
- {pin_num: P14, pin_signal: VSS29, label: GND}
- {pin_num: T14, pin_signal: VDD_SNVS_DIG, label: VDD_SNVS_DIG}
- {pin_num: U14, pin_signal: VDD_SNVS_ANA, label: VDD_SNVS_ANA}
- {pin_num: A15, pin_signal: GPIO_DISP_B1_08, label: ENET_RGMII_TXD1, identifier: ENET_RGMII_TXD1}
- {pin_num: G15, pin_signal: VSS30, label: GND}
- {pin_num: K15, pin_signal: VDDA_ADC_1P8, label: ADC_1V8_IN}
- {pin_num: L15, pin_signal: VSS31, label: GND}
- {pin_num: C16, pin_signal: USB2_DN, label: OTG2_DN, identifier: OTG2_DN}
- {pin_num: D16, pin_signal: USB2_VBUS, label: 5V_USB_OTG2}
- {pin_num: E16, pin_signal: USB1_DN, label: OTG1_DN, identifier: OTG1_DN}
- {pin_num: G16, pin_signal: ADC_VREFH, label: ADC_1V8_IN}
- {pin_num: A17, pin_signal: VSS32, label: GND}
- {pin_num: C17, pin_signal: USB2_DP, label: OTG2_DP, identifier: OTG2_DP}
- {pin_num: D17, pin_signal: USB1_VBUS, label: 5V_USB_OTG1}
- {pin_num: E17, pin_signal: USB1_DP, label: OTG1_DP}
- {pin_num: J17, pin_signal: GPIO_AD_31, label: LPSPI1_SDI, identifier: LPSPI1_SDI}
- {pin_num: K17, pin_signal: GPIO_AD_30, label: LPSPI1_SDO, identifier: LPSPI1_SDO}
- {pin_num: U17, pin_signal: VSS33, label: GND}
- {pin_num: B16, pin_signal: GPIO_SD_B1_00, label: QSPI_FLASH_RESET, identifier: QSPI_FLASH_RESET}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_xbara.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

