DileepMys/HERO_RAA_2.0V/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: E13, peripheral: LCDIF, signal: lcdif_clk, pin_signal: GPIO_DISP_B1_00}
  - {pin_num: E10, peripheral: LCDIF, signal: 'lcdif_data, 00', pin_signal: GPIO_DISP_B1_04}
  - {pin_num: C11, peripheral: LCDIF, signal: 'lcdif_data, 01', pin_signal: GPIO_DISP_B1_05}
  - {pin_num: D10, peripheral: LCDIF, signal: 'lcdif_data, 02', pin_signal: GPIO_DISP_B1_06}
  - {pin_num: E12, peripheral: LCDIF, signal: 'lcdif_data, 03', pin_signal: GPIO_DISP_B1_07}
  - {pin_num: A15, peripheral: LCDIF, signal: 'lcdif_data, 04', pin_signal: GPIO_DISP_B1_08}
  - {pin_num: C13, peripheral: LCDIF, signal: 'lcdif_data, 05', pin_signal: GPIO_DISP_B1_09}
  - {pin_num: B14, peripheral: LCDIF, signal: 'lcdif_data, 06', pin_signal: GPIO_DISP_B1_10}
  - {pin_num: A14, peripheral: LCDIF, signal: 'lcdif_data, 07', pin_signal: GPIO_DISP_B1_11}
  - {pin_num: E8, peripheral: LCDIF, signal: 'lcdif_data, 08', pin_signal: GPIO_DISP_B2_00}
  - {pin_num: F8, peripheral: LCDIF, signal: 'lcdif_data, 09', pin_signal: GPIO_DISP_B2_01}
  - {pin_num: E9, peripheral: LCDIF, signal: 'lcdif_data, 10', pin_signal: GPIO_DISP_B2_02}
  - {pin_num: D7, peripheral: LCDIF, signal: 'lcdif_data, 11', pin_signal: GPIO_DISP_B2_03}
  - {pin_num: C7, peripheral: LCDIF, signal: 'lcdif_data, 12', pin_signal: GPIO_DISP_B2_04}
  - {pin_num: C9, peripheral: LCDIF, signal: 'lcdif_data, 13', pin_signal: GPIO_DISP_B2_05}
  - {pin_num: C6, peripheral: LCDIF, signal: 'lcdif_data, 14', pin_signal: GPIO_DISP_B2_06}
  - {pin_num: D6, peripheral: LCDIF, signal: 'lcdif_data, 15', pin_signal: GPIO_DISP_B2_07}
  - {pin_num: B5, peripheral: LCDIF, signal: 'lcdif_data, 16', pin_signal: GPIO_DISP_B2_08}
  - {pin_num: D8, peripheral: LCDIF, signal: 'lcdif_data, 17', pin_signal: GPIO_DISP_B2_09}
  - {pin_num: D9, peripheral: LCDIF, signal: 'lcdif_data, 18', pin_signal: GPIO_DISP_B2_10}
  - {pin_num: A6, peripheral: LCDIF, signal: 'lcdif_data, 19', pin_signal: GPIO_DISP_B2_11}
  - {pin_num: B6, peripheral: LCDIF, signal: 'lcdif_data, 20', pin_signal: GPIO_DISP_B2_12}
  - {pin_num: A5, peripheral: LCDIF, signal: 'lcdif_data, 21', pin_signal: GPIO_DISP_B2_13}
  - {pin_num: A7, peripheral: LCDIF, signal: 'lcdif_data, 22', pin_signal: GPIO_DISP_B2_14}
  - {pin_num: A4, peripheral: LCDIF, signal: 'lcdif_data, 23', pin_signal: GPIO_DISP_B2_15}
  - {pin_num: D11, peripheral: LCDIF, signal: lcdif_hsync, pin_signal: GPIO_DISP_B1_02}
  - {pin_num: E11, peripheral: LCDIF, signal: lcdif_vsync, pin_signal: GPIO_DISP_B1_03}
  - {pin_num: K13, peripheral: GPIO9, signal: 'gpio_io, 19', pin_signal: GPIO_AD_20, direction: OUTPUT, gpio_init_state: 'true', pull_up_down_config: Pull_Up}
  - {pin_num: N17, peripheral: GPIO9, signal: 'gpio_io, 15', pin_signal: GPIO_AD_16, identifier: bklt, direction: OUTPUT, pull_up_down_config: Pull_Up}
  - {pin_num: M14, peripheral: GPIO9, signal: 'gpio_io, 14', pin_signal: GPIO_AD_15, identifier: tft_3v3, direction: OUTPUT, pull_up_down_config: Pull_Up}
  - {pin_num: M13, peripheral: GPIO9, signal: 'gpio_io, 03', pin_signal: GPIO_AD_04, identifier: batt_sw, direction: OUTPUT, gpio_init_state: 'true', pull_up_down_config: Pull_Down}
  - {pin_num: L17, peripheral: GPIO9, signal: 'gpio_io, 27', pin_signal: GPIO_AD_28, identifier: batt_en, direction: OUTPUT, gpio_init_state: 'true', pull_up_down_config: Pull_Up}
  - {pin_num: R13, peripheral: GPIO9, signal: 'gpio_io, 01', pin_signal: GPIO_AD_02, identifier: tft_xres, direction: OUTPUT, gpio_init_state: 'true', pull_up_down_config: Pull_Up}
  - {pin_num: D13, peripheral: GPIO10, signal: 'gpio_io, 22', pin_signal: GPIO_DISP_B1_01, identifier: tft_csb, direction: OUTPUT, pull_down_pull_up_config: Pull_Up}
  - {pin_num: N14, peripheral: GPIO9, signal: 'gpio_io, 13', pin_signal: GPIO_AD_14, direction: OUTPUT}
  - {pin_num: N6, peripheral: CAN3, signal: TX, pin_signal: GPIO_LPSR_00}
  - {pin_num: R6, peripheral: CAN3, signal: RX, pin_signal: GPIO_LPSR_01}
  - {pin_num: L16, peripheral: GPIO9, signal: 'gpio_io, 18', pin_signal: GPIO_AD_19, direction: OUTPUT}
  - {pin_num: P16, peripheral: LPADC1, signal: 'B, 1_2', pin_signal: GPIO_AD_11, software_input_on: Enable, pull_up_down_config: no_init, pull_keeper_select: Keeper,
    drive_strength: no_init, slew_rate: no_init}
  - {pin_num: R3, peripheral: GPIO8, signal: 'gpio_io, 30', pin_signal: GPIO_EMC_B2_20, identifier: FUEL_SBATT_CTRL_MCUOUT, direction: OUTPUT}
  - {pin_num: R16, peripheral: LPADC1, signal: 'B, 1_1', pin_signal: GPIO_AD_09, identifier: AI_FUEL_MCU_IN, software_input_on: Enable, pull_up_down_config: no_init,
    pull_keeper_select: Keeper, open_drain: Disable, drive_strength: no_init, slew_rate: no_init}
  - {pin_num: R17, peripheral: LPADC1, signal: 'A, 1_2', pin_signal: GPIO_AD_10, software_input_on: Enable, pull_up_down_config: no_init, pull_keeper_select: Keeper,
    drive_strength: no_init, slew_rate: no_init}
  - {pin_num: U2, peripheral: GPIO8, signal: 'gpio_io, 29', pin_signal: GPIO_EMC_B2_19, identifier: DO_BATT_MON_EN, direction: OUTPUT}
  - {pin_num: C15, peripheral: GPIO10, signal: 'gpio_io, 05', pin_signal: GPIO_SD_B1_02, identifier: DI_LOW_OIL_PRESSURE_MCU_IN, direction: INPUT, software_input_on: Disable}
  - {pin_num: N7, peripheral: LPI2C5, signal: SDA, pin_signal: GPIO_LPSR_04, identifier: EEPROM_I2C_SDA, software_input_on: Enable, pull_up_down_config: Pull_Down,
    open_drain: Enable, drive_strength: Normal}
  - {pin_num: N8, peripheral: LPI2C5, signal: SCL, pin_signal: GPIO_LPSR_05, identifier: EEPROM_I2C_SCL, software_input_on: Enable, pull_up_down_config: Pull_Down,
    open_drain: Enable, drive_strength: Normal}
  - {pin_num: T8, peripheral: GPIO13, signal: 'gpio_io, 00', pin_signal: WAKEUP, direction: INPUT}
  - {pin_num: J9, peripheral: SUPPLY, signal: 'VDD_SOC_IN, 3', pin_signal: VDD_SOC_IN3}
  - {pin_num: B17, peripheral: GPIO10, signal: 'gpio_io, 06', pin_signal: GPIO_SD_B1_03, identifier: DI_HANDLEBAR_SW_SET_MCU_IN, direction: INPUT, software_input_on: Enable}
  - {pin_num: P3, peripheral: SUPPLY, signal: dcdc_pswitch, pin_signal: DCDC_PSWITCH}
  - {pin_num: B1, peripheral: GPIO7, signal: 'gpio_io, 14', pin_signal: GPIO_EMC_B1_14, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: C1, peripheral: GPIO7, signal: 'gpio_io, 15', pin_signal: GPIO_EMC_B1_15, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: D1, peripheral: GPIO8, signal: 'gpio_io, 00', pin_signal: GPIO_EMC_B1_32, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: E1, peripheral: GPIO8, signal: 'gpio_io, 02', pin_signal: GPIO_EMC_B1_34, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: F1, peripheral: GPIO8, signal: 'gpio_io, 03', pin_signal: GPIO_EMC_B1_35, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: G1, peripheral: GPIO8, signal: 'gpio_io, 04', pin_signal: GPIO_EMC_B1_36, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: H1, peripheral: GPIO8, signal: 'gpio_io, 05', pin_signal: GPIO_EMC_B1_37, identifier: SEMC_D15, direction: OUTPUT, software_input_on: Enable, pull_down_pull_up_config: No_Pull,
    pdrv_config: Normal_Driver}
  - {pin_num: J1, peripheral: GPIO8, signal: 'gpio_io, 06', pin_signal: GPIO_EMC_B1_38, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: K1, peripheral: GPIO8, signal: 'gpio_io, 08', pin_signal: GPIO_EMC_B1_40, direction: INPUT}
  - {pin_num: L1, peripheral: GPIO8, signal: 'gpio_io, 09', pin_signal: GPIO_EMC_B1_41, direction: INPUT}
  - {pin_num: M1, peripheral: GPIO8, signal: 'gpio_io, 14', pin_signal: GPIO_EMC_B2_04, direction: INPUT}
  - {pin_num: N1, peripheral: GPIO8, signal: 'gpio_io, 15', pin_signal: GPIO_EMC_B2_05, direction: INPUT}
  - {pin_num: P1, peripheral: GPIO8, signal: 'gpio_io, 18', pin_signal: GPIO_EMC_B2_08, direction: INPUT}
  - {pin_num: R1, peripheral: GPIO8, signal: 'gpio_io, 13', pin_signal: GPIO_EMC_B2_03, direction: INPUT}
  - {pin_num: T1, peripheral: GPIO8, signal: 'gpio_io, 16', pin_signal: GPIO_EMC_B2_06, direction: INPUT}
  - {pin_num: A2, peripheral: GPIO7, signal: 'gpio_io, 10', pin_signal: GPIO_EMC_B1_10, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: B2, peripheral: GPIO7, signal: 'gpio_io, 23', pin_signal: GPIO_EMC_B1_23, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: C2, peripheral: GPIO7, signal: 'gpio_io, 11', pin_signal: GPIO_EMC_B1_11, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: D2, peripheral: GPIO7, signal: 'gpio_io, 31', pin_signal: GPIO_EMC_B1_31, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: E2, peripheral: GPIO8, signal: 'gpio_io, 01', pin_signal: GPIO_EMC_B1_33, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: F2, peripheral: GPIO7, signal: 'gpio_io, 01', pin_signal: GPIO_EMC_B1_01, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: G2, peripheral: GPIO7, signal: 'gpio_io, 21', pin_signal: GPIO_EMC_B1_21, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: H2, peripheral: GPIO7, signal: 'gpio_io, 22', pin_signal: GPIO_EMC_B1_22, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: J2, peripheral: GPIO8, signal: 'gpio_io, 07', pin_signal: GPIO_EMC_B1_39, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: K2, peripheral: GPIO8, signal: 'gpio_io, 10', pin_signal: GPIO_EMC_B2_00, direction: INPUT}
  - {pin_num: L2, peripheral: GPIO8, signal: 'gpio_io, 25', pin_signal: GPIO_EMC_B2_15, direction: INPUT}
  - {pin_num: M2, peripheral: GPIO8, signal: 'gpio_io, 22', pin_signal: GPIO_EMC_B2_12, direction: INPUT}
  - {pin_num: N2, peripheral: GPIO8, signal: 'gpio_io, 19', pin_signal: GPIO_EMC_B2_09, direction: INPUT}
  - {pin_num: P2, peripheral: GPIO8, signal: 'gpio_io, 26', pin_signal: GPIO_EMC_B2_16, direction: INPUT}
  - {pin_num: R2, peripheral: GPIO8, signal: 'gpio_io, 20', pin_signal: GPIO_EMC_B2_10, direction: INPUT}
  - {pin_num: T2, peripheral: GPIO8, signal: 'gpio_io, 27', pin_signal: GPIO_EMC_B2_17, direction: INPUT}
  - {pin_num: A3, peripheral: GPIO7, signal: 'gpio_io, 09', pin_signal: GPIO_EMC_B1_09, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: B3, peripheral: GPIO7, signal: 'gpio_io, 17', pin_signal: GPIO_EMC_B1_17, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: C3, peripheral: GPIO7, signal: 'gpio_io, 20', pin_signal: GPIO_EMC_B1_20, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: D3, peripheral: GPIO7, signal: 'gpio_io, 16', pin_signal: GPIO_EMC_B1_16, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: E3, peripheral: GPIO7, signal: 'gpio_io, 30', pin_signal: GPIO_EMC_B1_30, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: F3, peripheral: GPIO7, signal: 'gpio_io, 00', pin_signal: GPIO_EMC_B1_00, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: H3, peripheral: GPIO7, signal: 'gpio_io, 07', pin_signal: GPIO_EMC_B1_07, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: J3, peripheral: GPIO7, signal: 'gpio_io, 26', pin_signal: GPIO_EMC_B1_26, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: K3, peripheral: GPIO8, signal: 'gpio_io, 12', pin_signal: GPIO_EMC_B2_02, direction: INPUT}
  - {pin_num: M3, peripheral: GPIO8, signal: 'gpio_io, 17', pin_signal: GPIO_EMC_B2_07, direction: INPUT}
  - {pin_num: N3, peripheral: GPIO8, signal: 'gpio_io, 28', pin_signal: GPIO_EMC_B2_18, direction: INPUT}
  - {pin_num: B4, peripheral: GPIO7, signal: 'gpio_io, 18', pin_signal: GPIO_EMC_B1_18, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: C4, peripheral: GPIO7, signal: 'gpio_io, 19', pin_signal: GPIO_EMC_B1_19, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: E4, peripheral: GPIO7, signal: 'gpio_io, 03', pin_signal: GPIO_EMC_B1_03, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: F4, peripheral: GPIO7, signal: 'gpio_io, 05', pin_signal: GPIO_EMC_B1_05, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: G4, peripheral: GPIO7, signal: 'gpio_io, 02', pin_signal: GPIO_EMC_B1_02, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: H4, peripheral: GPIO7, signal: 'gpio_io, 06', pin_signal: GPIO_EMC_B1_06, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: J4, peripheral: GPIO7, signal: 'gpio_io, 25', pin_signal: GPIO_EMC_B1_25, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: K4, peripheral: GPIO8, signal: 'gpio_io, 11', pin_signal: GPIO_EMC_B2_01, direction: INPUT}
  - {pin_num: L4, peripheral: GPIO8, signal: 'gpio_io, 21', pin_signal: GPIO_EMC_B2_11, direction: INPUT}
  - {pin_num: M4, peripheral: GPIO8, signal: 'gpio_io, 24', pin_signal: GPIO_EMC_B2_14, direction: INPUT}
  - {pin_num: C5, peripheral: GPIO7, signal: 'gpio_io, 12', pin_signal: GPIO_EMC_B1_12, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: D5, peripheral: GPIO7, signal: 'gpio_io, 13', pin_signal: GPIO_EMC_B1_13, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: E5, peripheral: GPIO7, signal: 'gpio_io, 28', pin_signal: GPIO_EMC_B1_28, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: F5, peripheral: GPIO7, signal: 'gpio_io, 08', pin_signal: GPIO_EMC_B1_08, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: G5, peripheral: GPIO7, signal: 'gpio_io, 27', pin_signal: GPIO_EMC_B1_27, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: H5, peripheral: GPIO7, signal: 'gpio_io, 04', pin_signal: GPIO_EMC_B1_04, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: J5, peripheral: GPIO7, signal: 'gpio_io, 24', pin_signal: GPIO_EMC_B1_24, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: K5, peripheral: GPIO8, signal: 'gpio_io, 23', pin_signal: GPIO_EMC_B2_13, direction: INPUT}
  - {pin_num: E6, peripheral: GPIO7, signal: 'gpio_io, 29', pin_signal: GPIO_EMC_B1_29, direction: OUTPUT, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: U9, peripheral: SNVS, signal: snvs_lp_pmic_on_req, pin_signal: PMIC_ON_REQ}
  - {pin_num: P15, peripheral: GPIO9, signal: 'gpio_io, 02', pin_signal: GPIO_AD_03, identifier: FOG_LAMP, direction: INPUT}
  - {pin_num: B15, peripheral: GPIO10, signal: 'gpio_io, 07', pin_signal: GPIO_SD_B1_04, identifier: DI_HANDLEBAR_SW_RETURN_MCU_IN, direction: INPUT, software_input_on: Enable}
  - {pin_num: D15, peripheral: GPIO10, signal: 'gpio_io, 04', pin_signal: GPIO_SD_B1_01, identifier: DI_HANDLEBAR_SW_DOWN_MCU_IN, direction: INPUT, software_input_on: Enable,
    pull_down_pull_up_config: Pull_Up}
  - {pin_num: A16, peripheral: GPIO10, signal: 'gpio_io, 08', pin_signal: GPIO_SD_B1_05, identifier: DI_HANDLEBAR_SW_UP_MCU_IN, direction: INPUT, software_input_on: Enable,
    pull_down_pull_up_config: Pull_Up}
  - {pin_num: J12, peripheral: GPIO3, signal: 'gpio_mux_io, 22', pin_signal: GPIO_AD_23}
  - {pin_num: L12, peripheral: GPIO9, signal: 'gpio_io, 12', pin_signal: GPIO_AD_13, direction: OUTPUT}
  - {pin_num: M16, peripheral: LPADC2, signal: 'A, 2_0', pin_signal: GPIO_AD_18, pull_keeper_select: Keeper}
  - {pin_num: N12, peripheral: PWM1, signal: 'A, 0', pin_signal: GPIO_AD_00, identifier: Illum_PWM, direction: OUTPUT, pull_keeper_select: Pull}
  - {peripheral: PWM1, signal: 'FAULT, 0', pin_signal: LOGIC_HIGH}
  - {pin_num: K16, peripheral: LPUART10, signal: TXD, pin_signal: GPIO_AD_32, identifier: BTLE_UART_TX}
  - {pin_num: H17, peripheral: LPUART10, signal: RXD, pin_signal: GPIO_AD_33}
  - {pin_num: U8, peripheral: GPIO12, signal: 'gpio_io, 08', pin_signal: GPIO_LPSR_08, direction: OUTPUT}
  - {pin_num: N15, peripheral: GPIO9, signal: 'gpio_io, 16', pin_signal: GPIO_AD_17, direction: OUTPUT, gpio_init_state: 'false'}
  - {pin_num: P8, peripheral: LPI2C6, signal: SDA, pin_signal: GPIO_LPSR_06, direction: OUTPUT, software_input_on: Enable, pull_up_down_config: Pull_Up, open_drain: Enable,
    drive_strength: Normal}
  - {pin_num: R8, peripheral: LPI2C6, signal: SCL, pin_signal: GPIO_LPSR_07, direction: OUTPUT, software_input_on: Enable, pull_up_down_config: Pull_Up, open_drain: Enable,
    drive_strength: Normal}
  - {pin_num: K17, peripheral: CAN2, signal: TX, pin_signal: GPIO_AD_30}
  - {pin_num: J17, peripheral: CAN2, signal: RX, pin_signal: GPIO_AD_31}
