DileepMys/HERO_RAA_2.0V/board/pin_mux.c
  - {pin_num: M17, peripheral: GPIO9, signal: 'gpio_io, 28', pin_signal: GPIO_AD_29, identifier: LPSPI1_PCS0, direction: OUTPUT}
  - {pin_num: F17, peripheral: FLEXSPI1, signal: FLEXSPI_A_SS0_B, pin_signal: GPIO_SD_B2_06, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: F16, peripheral: FLEXSPI1, signal: FLEXSPI_A_DATA3, pin_signal: GPIO_SD_B2_11, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: H15, peripheral: FLEXSPI1, signal: FLEXSPI_A_DATA1, pin_signal: GPIO_SD_B2_09, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: F15, peripheral: FLEXSPI1, signal: FLEXSPI_A_DATA0, pin_signal: GPIO_SD_B2_08, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: H14, peripheral: FLEXSPI1, signal: FLEXSPI_A_DATA2, pin_signal: GPIO_SD_B2_10, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: G14, peripheral: FLEXSPI1, signal: FLEXSPI_A_SCLK, pin_signal: GPIO_SD_B2_07, pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr);      /* LPCG on: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Xbar1);            /* LPCG on: LPCG is ON. */

  /* GPIO configuration of SEMC_D0 on GPIO_EMC_B1_00 (pin F3) */
  gpio_pin_config_t SEMC_D0_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_00 (pin F3) */
  GPIO_PinInit(GPIO7, 0U, &SEMC_D0_config);

  /* GPIO configuration of SEMC_D1 on GPIO_EMC_B1_01 (pin F2) */
  gpio_pin_config_t SEMC_D1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_01 (pin F2) */
  GPIO_PinInit(GPIO7, 1U, &SEMC_D1_config);

  /* GPIO configuration of SEMC_D2 on GPIO_EMC_B1_02 (pin G4) */
  gpio_pin_config_t SEMC_D2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_02 (pin G4) */
  GPIO_PinInit(GPIO7, 2U, &SEMC_D2_config);

  /* GPIO configuration of SEMC_D3 on GPIO_EMC_B1_03 (pin E4) */
  gpio_pin_config_t SEMC_D3_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_03 (pin E4) */
  GPIO_PinInit(GPIO7, 3U, &SEMC_D3_config);

  /* GPIO configuration of SEMC_D4 on GPIO_EMC_B1_04 (pin H5) */
  gpio_pin_config_t SEMC_D4_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_04 (pin H5) */
  GPIO_PinInit(GPIO7, 4U, &SEMC_D4_config);

  /* GPIO configuration of SEMC_D5 on GPIO_EMC_B1_05 (pin F4) */
  gpio_pin_config_t SEMC_D5_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_05 (pin F4) */
  GPIO_PinInit(GPIO7, 5U, &SEMC_D5_config);

  /* GPIO configuration of SEMC_D6 on GPIO_EMC_B1_06 (pin H4) */
  gpio_pin_config_t SEMC_D6_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_06 (pin H4) */
  GPIO_PinInit(GPIO7, 6U, &SEMC_D6_config);

  /* GPIO configuration of SEMC_D7 on GPIO_EMC_B1_07 (pin H3) */
  gpio_pin_config_t SEMC_D7_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_07 (pin H3) */
  GPIO_PinInit(GPIO7, 7U, &SEMC_D7_config);

  /* GPIO configuration of SEMC_DM0 on GPIO_EMC_B1_08 (pin F5) */
  gpio_pin_config_t SEMC_DM0_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_08 (pin F5) */
  GPIO_PinInit(GPIO7, 8U, &SEMC_DM0_config);

  /* GPIO configuration of SEMC_A0 on GPIO_EMC_B1_09 (pin A3) */
  gpio_pin_config_t SEMC_A0_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_09 (pin A3) */
  GPIO_PinInit(GPIO7, 9U, &SEMC_A0_config);

  /* GPIO configuration of SEMC_A1 on GPIO_EMC_B1_10 (pin A2) */
  gpio_pin_config_t SEMC_A1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_10 (pin A2) */
  GPIO_PinInit(GPIO7, 10U, &SEMC_A1_config);

  /* GPIO configuration of SEMC_A2 on GPIO_EMC_B1_11 (pin C2) */
  gpio_pin_config_t SEMC_A2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_11 (pin C2) */
  GPIO_PinInit(GPIO7, 11U, &SEMC_A2_config);

  /* GPIO configuration of SEMC_A3 on GPIO_EMC_B1_12 (pin C5) */
  gpio_pin_config_t SEMC_A3_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_12 (pin C5) */
  GPIO_PinInit(GPIO7, 12U, &SEMC_A3_config);

