DileepMys/HERO_RAA_2.0V/board/pin_mux.c
  /* GPIO configuration of SEMC_A4 on GPIO_EMC_B1_13 (pin D5) */
  gpio_pin_config_t SEMC_A4_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_13 (pin D5) */
  GPIO_PinInit(GPIO7, 13U, &SEMC_A4_config);

  /* GPIO configuration of SEMC_A5 on GPIO_EMC_B1_14 (pin B1) */
  gpio_pin_config_t SEMC_A5_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_14 (pin B1) */
  GPIO_PinInit(GPIO7, 14U, &SEMC_A5_config);

  /* GPIO configuration of SEMC_A6 on GPIO_EMC_B1_15 (pin C1) */
  gpio_pin_config_t SEMC_A6_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_15 (pin C1) */
  GPIO_PinInit(GPIO7, 15U, &SEMC_A6_config);

  /* GPIO configuration of SEMC_A7 on GPIO_EMC_B1_16 (pin D3) */
  gpio_pin_config_t SEMC_A7_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_16 (pin D3) */
  GPIO_PinInit(GPIO7, 16U, &SEMC_A7_config);

  /* GPIO configuration of SEMC_A8 on GPIO_EMC_B1_17 (pin B3) */
  gpio_pin_config_t SEMC_A8_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_17 (pin B3) */
  GPIO_PinInit(GPIO7, 17U, &SEMC_A8_config);

  /* GPIO configuration of SEMC_A9 on GPIO_EMC_B1_18 (pin B4) */
  gpio_pin_config_t SEMC_A9_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_18 (pin B4) */
  GPIO_PinInit(GPIO7, 18U, &SEMC_A9_config);

  /* GPIO configuration of SEMC_A11 on GPIO_EMC_B1_19 (pin C4) */
  gpio_pin_config_t SEMC_A11_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_19 (pin C4) */
  GPIO_PinInit(GPIO7, 19U, &SEMC_A11_config);

  /* GPIO configuration of SEMC_A12 on GPIO_EMC_B1_20 (pin C3) */
  gpio_pin_config_t SEMC_A12_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_20 (pin C3) */
  GPIO_PinInit(GPIO7, 20U, &SEMC_A12_config);

  /* GPIO configuration of SEMC_BA0 on GPIO_EMC_B1_21 (pin G2) */
  gpio_pin_config_t SEMC_BA0_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_21 (pin G2) */
  GPIO_PinInit(GPIO7, 21U, &SEMC_BA0_config);

  /* GPIO configuration of SEMC_BA1 on GPIO_EMC_B1_22 (pin H2) */
  gpio_pin_config_t SEMC_BA1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_22 (pin H2) */
  GPIO_PinInit(GPIO7, 22U, &SEMC_BA1_config);

  /* GPIO configuration of SEMC_A10 on GPIO_EMC_B1_23 (pin B2) */
  gpio_pin_config_t SEMC_A10_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_23 (pin B2) */
  GPIO_PinInit(GPIO7, 23U, &SEMC_A10_config);

  /* GPIO configuration of SEMC_CAS on GPIO_EMC_B1_24 (pin J5) */
  gpio_pin_config_t SEMC_CAS_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_24 (pin J5) */
  GPIO_PinInit(GPIO7, 24U, &SEMC_CAS_config);

  /* GPIO configuration of SEMC_RAS on GPIO_EMC_B1_25 (pin J4) */
  gpio_pin_config_t SEMC_RAS_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_25 (pin J4) */
  GPIO_PinInit(GPIO7, 25U, &SEMC_RAS_config);

  /* GPIO configuration of SEMC_CLK on GPIO_EMC_B1_26 (pin J3) */
  gpio_pin_config_t SEMC_CLK_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_26 (pin J3) */
  GPIO_PinInit(GPIO7, 26U, &SEMC_CLK_config);

  /* GPIO configuration of SEMC_CKE on GPIO_EMC_B1_27 (pin G5) */
  gpio_pin_config_t SEMC_CKE_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_27 (pin G5) */
  GPIO_PinInit(GPIO7, 27U, &SEMC_CKE_config);

  /* GPIO configuration of SEMC_WE on GPIO_EMC_B1_28 (pin E5) */
  gpio_pin_config_t SEMC_WE_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_28 (pin E5) */
  GPIO_PinInit(GPIO7, 28U, &SEMC_WE_config);

  /* GPIO configuration of SEMC_CS0 on GPIO_EMC_B1_29 (pin E6) */
  gpio_pin_config_t SEMC_CS0_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_29 (pin E6) */
  GPIO_PinInit(GPIO7, 29U, &SEMC_CS0_config);

  /* GPIO configuration of SEMC_D8 on GPIO_EMC_B1_30 (pin E3) */
  gpio_pin_config_t SEMC_D8_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_30 (pin E3) */
  GPIO_PinInit(GPIO7, 30U, &SEMC_D8_config);

  /* GPIO configuration of SEMC_D9 on GPIO_EMC_B1_31 (pin D2) */
  gpio_pin_config_t SEMC_D9_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_31 (pin D2) */
  GPIO_PinInit(GPIO7, 31U, &SEMC_D9_config);

  /* GPIO configuration of SEMC_D10 on GPIO_EMC_B1_32 (pin D1) */
  gpio_pin_config_t SEMC_D10_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_32 (pin D1) */
  GPIO_PinInit(GPIO8, 0U, &SEMC_D10_config);

  /* GPIO configuration of SEMC_D11 on GPIO_EMC_B1_33 (pin E2) */
  gpio_pin_config_t SEMC_D11_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_33 (pin E2) */
  GPIO_PinInit(GPIO8, 1U, &SEMC_D11_config);

  /* GPIO configuration of SEMC_D12 on GPIO_EMC_B1_34 (pin E1) */
  gpio_pin_config_t SEMC_D12_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_34 (pin E1) */
  GPIO_PinInit(GPIO8, 2U, &SEMC_D12_config);

  /* GPIO configuration of SEMC_D13 on GPIO_EMC_B1_35 (pin F1) */
  gpio_pin_config_t SEMC_D13_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_35 (pin F1) */
  GPIO_PinInit(GPIO8, 3U, &SEMC_D13_config);

  /* GPIO configuration of SEMC_D14 on GPIO_EMC_B1_36 (pin G1) */
  gpio_pin_config_t SEMC_D14_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_36 (pin G1) */
  GPIO_PinInit(GPIO8, 4U, &SEMC_D14_config);

  /* GPIO configuration of SEMC_D15 on GPIO_EMC_B1_37 (pin H1) */
  gpio_pin_config_t SEMC_D15_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_37 (pin H1) */
  GPIO_PinInit(GPIO8, 5U, &SEMC_D15_config);

  /* GPIO configuration of SEMC_DM1 on GPIO_EMC_B1_38 (pin J1) */
  gpio_pin_config_t SEMC_DM1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_38 (pin J1) */
  GPIO_PinInit(GPIO8, 6U, &SEMC_DM1_config);

  /* GPIO configuration of SEMC_DQS on GPIO_EMC_B1_39 (pin J2) */
  gpio_pin_config_t SEMC_DQS_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_39 (pin J2) */
  GPIO_PinInit(GPIO8, 7U, &SEMC_DQS_config);

