DileepMys/HERO_RAA_2.0V/board/pin_mux.c
  /* GPIO configuration of SEMC_RDY on GPIO_EMC_B1_40 (pin K1) */
  gpio_pin_config_t SEMC_RDY_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_40 (pin K1) */
  GPIO_PinInit(GPIO8, 8U, &SEMC_RDY_config);

  /* GPIO configuration of SEMC_CSX0 on GPIO_EMC_B1_41 (pin L1) */
  gpio_pin_config_t SEMC_CSX0_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_41 (pin L1) */
  GPIO_PinInit(GPIO8, 9U, &SEMC_CSX0_config);

  /* GPIO configuration of SEMC_D16 on GPIO_EMC_B2_00 (pin K2) */
  gpio_pin_config_t SEMC_D16_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_00 (pin K2) */
  GPIO_PinInit(GPIO8, 10U, &SEMC_D16_config);

  /* GPIO configuration of SEMC_D17 on GPIO_EMC_B2_01 (pin K4) */
  gpio_pin_config_t SEMC_D17_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_01 (pin K4) */
  GPIO_PinInit(GPIO8, 11U, &SEMC_D17_config);

  /* GPIO configuration of SEMC_D18 on GPIO_EMC_B2_02 (pin K3) */
  gpio_pin_config_t SEMC_D18_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_02 (pin K3) */
  GPIO_PinInit(GPIO8, 12U, &SEMC_D18_config);

  /* GPIO configuration of SEMC_D19 on GPIO_EMC_B2_03 (pin R1) */
  gpio_pin_config_t SEMC_D19_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_03 (pin R1) */
  GPIO_PinInit(GPIO8, 13U, &SEMC_D19_config);

  /* GPIO configuration of SEMC_D20 on GPIO_EMC_B2_04 (pin M1) */
  gpio_pin_config_t SEMC_D20_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_04 (pin M1) */
  GPIO_PinInit(GPIO8, 14U, &SEMC_D20_config);

  /* GPIO configuration of SEMC_D21 on GPIO_EMC_B2_05 (pin N1) */
  gpio_pin_config_t SEMC_D21_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_05 (pin N1) */
  GPIO_PinInit(GPIO8, 15U, &SEMC_D21_config);

  /* GPIO configuration of SEMC_D22 on GPIO_EMC_B2_06 (pin T1) */
  gpio_pin_config_t SEMC_D22_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_06 (pin T1) */
  GPIO_PinInit(GPIO8, 16U, &SEMC_D22_config);

  /* GPIO configuration of SEMC_D23 on GPIO_EMC_B2_07 (pin M3) */
  gpio_pin_config_t SEMC_D23_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_07 (pin M3) */
  GPIO_PinInit(GPIO8, 17U, &SEMC_D23_config);

  /* GPIO configuration of SEMC_DM2 on GPIO_EMC_B2_08 (pin P1) */
  gpio_pin_config_t SEMC_DM2_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_08 (pin P1) */
  GPIO_PinInit(GPIO8, 18U, &SEMC_DM2_config);

  /* GPIO configuration of SEMC_D24 on GPIO_EMC_B2_09 (pin N2) */
  gpio_pin_config_t SEMC_D24_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_09 (pin N2) */
  GPIO_PinInit(GPIO8, 19U, &SEMC_D24_config);

  /* GPIO configuration of SEMC_D25 on GPIO_EMC_B2_10 (pin R2) */
  gpio_pin_config_t SEMC_D25_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_10 (pin R2) */
  GPIO_PinInit(GPIO8, 20U, &SEMC_D25_config);

  /* GPIO configuration of SEMC_D26 on GPIO_EMC_B2_11 (pin L4) */
  gpio_pin_config_t SEMC_D26_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_11 (pin L4) */
  GPIO_PinInit(GPIO8, 21U, &SEMC_D26_config);

  /* GPIO configuration of SEMC_D27 on GPIO_EMC_B2_12 (pin M2) */
  gpio_pin_config_t SEMC_D27_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_12 (pin M2) */
  GPIO_PinInit(GPIO8, 22U, &SEMC_D27_config);

  /* GPIO configuration of SEMC_D28 on GPIO_EMC_B2_13 (pin K5) */
  gpio_pin_config_t SEMC_D28_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_13 (pin K5) */
  GPIO_PinInit(GPIO8, 23U, &SEMC_D28_config);

  /* GPIO configuration of SEMC_D29 on GPIO_EMC_B2_14 (pin M4) */
  gpio_pin_config_t SEMC_D29_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_14 (pin M4) */
  GPIO_PinInit(GPIO8, 24U, &SEMC_D29_config);

  /* GPIO configuration of SEMC_D30 on GPIO_EMC_B2_15 (pin L2) */
  gpio_pin_config_t SEMC_D30_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_15 (pin L2) */
  GPIO_PinInit(GPIO8, 25U, &SEMC_D30_config);

  /* GPIO configuration of SEMC_D31 on GPIO_EMC_B2_16 (pin P2) */
  gpio_pin_config_t SEMC_D31_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_16 (pin P2) */
  GPIO_PinInit(GPIO8, 26U, &SEMC_D31_config);

  /* GPIO configuration of SEMC_DM3 on GPIO_EMC_B2_17 (pin T2) */
  gpio_pin_config_t SEMC_DM3_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_17 (pin T2) */
  GPIO_PinInit(GPIO8, 27U, &SEMC_DM3_config);

  /* GPIO configuration of SEMC_DQS4 on GPIO_EMC_B2_18 (pin N3) */
  gpio_pin_config_t SEMC_DQS4_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_18 (pin N3) */
  GPIO_PinInit(GPIO8, 28U, &SEMC_DQS4_config);

