DileepMys/HERO_RAA_2.0V/board/pin_mux.c
  /* GPIO configuration of DO_BATT_MON_EN on GPIO_EMC_B2_19 (pin U2) */
  gpio_pin_config_t DO_BATT_MON_EN_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_19 (pin U2) */
  GPIO_PinInit(GPIO8, 29U, &DO_BATT_MON_EN_config);

  /* GPIO configuration of FUEL_SBATT_CTRL_MCUOUT on GPIO_EMC_B2_20 (pin R3) */
  gpio_pin_config_t FUEL_SBATT_CTRL_MCUOUT_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_20 (pin R3) */
  GPIO_PinInit(GPIO8, 30U, &FUEL_SBATT_CTRL_MCUOUT_config);

  /* GPIO configuration of tft_xres on GPIO_AD_02 (pin R13) */
  gpio_pin_config_t tft_xres_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_02 (pin R13) */
  GPIO_PinInit(GPIO9, 1U, &tft_xres_config);

  /* GPIO configuration of FOG_LAMP on GPIO_AD_03 (pin P15) */
  gpio_pin_config_t FOG_LAMP_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_03 (pin P15) */
  GPIO_PinInit(GPIO9, 2U, &FOG_LAMP_config);

  /* GPIO configuration of batt_sw on GPIO_AD_04 (pin M13) */
  gpio_pin_config_t batt_sw_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_04 (pin M13) */
  GPIO_PinInit(GPIO9, 3U, &batt_sw_config);

  /* GPIO configuration of TT_SS_DIG_MCU_OUT on GPIO_AD_13 (pin L12) */
  gpio_pin_config_t TT_SS_DIG_MCU_OUT_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_13 (pin L12) */
  GPIO_PinInit(GPIO9, 12U, &TT_SS_DIG_MCU_OUT_config);

  /* GPIO configuration of CAN_STB on GPIO_AD_14 (pin N14) */
  gpio_pin_config_t CAN_STB_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_14 (pin N14) */
  GPIO_PinInit(GPIO9, 13U, &CAN_STB_config);

  /* GPIO configuration of tft_3v3 on GPIO_AD_15 (pin M14) */
  gpio_pin_config_t tft_3v3_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_15 (pin M14) */
  GPIO_PinInit(GPIO9, 14U, &tft_3v3_config);

  /* GPIO configuration of bklt on GPIO_AD_16 (pin N17) */
  gpio_pin_config_t bklt_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_16 (pin N17) */
  GPIO_PinInit(GPIO9, 15U, &bklt_config);

  /* GPIO configuration of BLE_3P3V_EN on GPIO_AD_17 (pin N15) */
  gpio_pin_config_t BLE_3P3V_EN_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_17 (pin N15) */
  GPIO_PinInit(GPIO9, 16U, &BLE_3P3V_EN_config);

  /* GPIO configuration of ABS on GPIO_AD_19 (pin L16) */
  gpio_pin_config_t ABS_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_19 (pin L16) */
  GPIO_PinInit(GPIO9, 18U, &ABS_config);

  /* GPIO configuration of en_5v on GPIO_AD_20 (pin K13) */
  gpio_pin_config_t en_5v_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_20 (pin K13) */
  GPIO_PinInit(GPIO9, 19U, &en_5v_config);

  /* GPIO configuration of batt_en on GPIO_AD_28 (pin L17) */
  gpio_pin_config_t batt_en_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_28 (pin L17) */
  GPIO_PinInit(GPIO9, 27U, &batt_en_config);

  /* GPIO configuration of LPSPI1_PCS0 on GPIO_AD_29 (pin M17) */
  gpio_pin_config_t LPSPI1_PCS0_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_29 (pin M17) */
  GPIO_PinInit(GPIO9, 28U, &LPSPI1_PCS0_config);

  /* GPIO configuration of DI_HANDLEBAR_SW_DOWN_MCU_IN on GPIO_SD_B1_01 (pin D15) */
  gpio_pin_config_t DI_HANDLEBAR_SW_DOWN_MCU_IN_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B1_01 (pin D15) */
  GPIO_PinInit(GPIO10, 4U, &DI_HANDLEBAR_SW_DOWN_MCU_IN_config);

  /* GPIO configuration of DI_LOW_OIL_PRESSURE_MCU_IN on GPIO_SD_B1_02 (pin C15) */
  gpio_pin_config_t DI_LOW_OIL_PRESSURE_MCU_IN_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B1_02 (pin C15) */
  GPIO_PinInit(GPIO10, 5U, &DI_LOW_OIL_PRESSURE_MCU_IN_config);

  /* GPIO configuration of DI_HANDLEBAR_SW_SET_MCU_IN on GPIO_SD_B1_03 (pin B17) */
  gpio_pin_config_t DI_HANDLEBAR_SW_SET_MCU_IN_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B1_03 (pin B17) */
  GPIO_PinInit(GPIO10, 6U, &DI_HANDLEBAR_SW_SET_MCU_IN_config);

  /* GPIO configuration of DI_HANDLEBAR_SW_RETURN_MCU_IN on GPIO_SD_B1_04 (pin B15) */
  gpio_pin_config_t DI_HANDLEBAR_SW_RETURN_MCU_IN_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B1_04 (pin B15) */
  GPIO_PinInit(GPIO10, 7U, &DI_HANDLEBAR_SW_RETURN_MCU_IN_config);

  /* GPIO configuration of DI_HANDLEBAR_SW_UP_MCU_IN on GPIO_SD_B1_05 (pin A16) */
  gpio_pin_config_t DI_HANDLEBAR_SW_UP_MCU_IN_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B1_05 (pin A16) */
  GPIO_PinInit(GPIO10, 8U, &DI_HANDLEBAR_SW_UP_MCU_IN_config);

  /* GPIO configuration of tft_csb on GPIO_DISP_B1_01 (pin D13) */
  gpio_pin_config_t tft_csb_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_DISP_B1_01 (pin D13) */
  GPIO_PinInit(GPIO10, 22U, &tft_csb_config);

